Revit 2027 API
FailureMessage.SetFailingElements Method
 Sets elements that have caused the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureMessage SetFailingElements(
	ICollection<ElementId> idsToShow
)
Public Function SetFailingElements (
	idsToShow As ICollection(Of ElementId)
) As FailureMessage
public:
FailureMessage^ SetFailingElements(
	ICollection<ElementId^>^ idsToShow
)
member SetFailingElements :
        idsToShow : ICollection<ElementId> -> FailureMessage
Parameters
idsToShow ICollection<ElementId>
 The elements that have caused the failure.
Return Value
FailureMessage
 The FailureMessage.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailureMessage is already posted to a document
Remarks
 In the Revit error dialog these elements will be highlighted to the user and can be deleted by user via extended error dialog.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace